; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image5 - mode
	thermograph2 - mode
	image4 - mode
	thermograph1 - mode
	spectrograph3 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared0)
	(supports instrument0 image5)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph1)
	(supports instrument4 image5)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image4)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument8 image5)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 infrared0)
	(supports instrument9 image5)
	(calibration_target instrument9 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(pointing satellite1 Star2)
	(pointing satellite2 GroundStation1)
	(pointing satellite4 Star3)
	(have_image Phenomenon5 image4)
	(have_image Star6 image5)
	(have_image Star6 image4)
	(have_image Phenomenon7 image5)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon11 image5)
	(have_image Planet12 infrared0)
	(have_image Planet12 thermograph2)
))

)

; plan
1. (turn_to satellite2 star3 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star3)
   goals met: 0 of 15
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 15
3. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 15
4. (turn_to satellite2 planet12 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet12)
   goals met: 0 of 15
5. (take_image satellite2 planet12 instrument5 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 1 of 15
6. (turn_to satellite2 phenomenon5 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 15
7. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 15
8. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 1 of 15
9. (take_image satellite2 phenomenon5 instrument5 image4)
   added: (have_image phenomenon5 image4)
   goals met: 2 of 15
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 15
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 15
12. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 15
13. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 15
14. (turn_to satellite0 phenomenon11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 15
15. (take_image satellite0 phenomenon11 instrument0 image5)
   added: (have_image phenomenon11 image5)
   goals met: 3 of 15
16. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 15
17. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 15
18. (take_image satellite0 phenomenon7 instrument0 image5)
   added: (have_image phenomenon7 image5)
   goals met: 5 of 15
19. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 6 of 15
20. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 6 of 15
21. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 7 of 15
22. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 7 of 15
23. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 8 of 15
24. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 8 of 15
25. (take_image satellite0 planet9 instrument0 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 9 of 15
26. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 9 of 15
27. (take_image satellite0 star6 instrument0 image5)
   added: (have_image star6 image5)
   goals met: 10 of 15
28. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 10 of 15
29. (take_image satellite1 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 11 of 15
30. (turn_to satellite1 star2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star2)
   goals met: 12 of 15
31. (turn_to satellite2 star6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star6)
   goals met: 12 of 15
32. (take_image satellite2 star6 instrument5 image4)
   added: (have_image star6 image4)
   goals met: 13 of 15
33. (turn_to satellite2 groundstation1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation1)
   goals met: 14 of 15
34. (turn_to satellite4 star3 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star3)
   goals met: 15 of 15
